In [36]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('Data-cleaning-for-beginners-using-pandas.csv')
df.head()

   Index   Age     Salary  Rating       Location  Established Easy Apply
0      0  44.0  $44k-$99k     5.4       India,In         1999       TRUE
1      1  66.0  $55k-$66k     3.5    New York,Ny         2002       TRUE
2      2   NaN  $77k-$89k    -1.0    New York,Ny           -1         -1
3      3  64.0  $44k-$99k     4.4       India In         1988         -1
4      4  25.0  $44k-$99k     6.4  Australia Aus         2002         -1

In [4]:
df.tail()

    Index   Age     Salary  Rating       Location  Established Easy Apply
24     24  13.0  $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0  $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   NaN  $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0  $44k-$99k     5.4       India,In         1935         -1
28     28   NaN  $39k-$88k     3.4  Australia Aus         1932         -1

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Index        29 non-null     int64
 1   Age          22 non-null     float64
 2   Salary       29 non-null     object
 3   Rating       28 non-null     float64
 4   Location     29 non-null     object
 5   Established  29 non-null     int64
 6   Easy Apply   29 non-null     object
dtypes: float64(2), int64(2), object(3)
memory usage: 1.7+ KB

In [6]:
df.shape

(29, 7)

In [7]:
df.isnull().sum()

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

In [8]:
df.columns

Index(['Index', 'Age', 'Salary', 'Rating', 'Location', 'Established',
       'Easy Apply'],
      dtype='object')

In [9]:
# Replace '-1' with NaN for easier handling
df.replace('-1', np.nan, inplace=True)

CLEANING THE SALARY COLUMN

In [10]:
# Replace 'k' with '000'
df['Salary'] = df['Salary'].str.replace('k', '000', regex=True)
# Remove '$' sign
df['Salary'] = df['Salary'].str.replace('[$]', '', regex=True)

In [11]:
# Calculating mean of the salary column
df['Salary'] = df['Salary'].str.split('-').apply(lambda x: (int(x[0].replace(',', '')), int(x[1].replace(',', '')))).apply(lambda x: np.mean(x))

In [12]:
df.head()

   Index   Age   Salary  Rating       Location  Established Easy Apply
0      0  44.0  71500.0     5.4       India,In         1999       TRUE
1      1  66.0  60500.0     3.5    New York,Ny         2002       TRUE
2      2   NaN  83000.0    -1.0    New York,Ny           -1        NaN
3      3  64.0  71500.0     4.4       India In         1988        NaN
4      4  25.0  71500.0     6.4  Australia Aus         2002        NaN

CLEANING THE LOCATION COLUMN

In [13]:
# Removing country codes
df['Location'] = df['Location'].replace({'New York,Ny':'New York', 'India,In':'India','India In':'India', 'Australia Aus':'Australia'})

In [14]:
df.head()

   Index   Age   Salary  Rating   Location  Established Easy Apply
0      0  44.0  71500.0     5.4      India         1999       TRUE
1      1  66.0  60500.0     3.5   New York         2002       TRUE
2      2   NaN  83000.0    -1.0   New York           -1        NaN
3      3  64.0  71500.0     4.4      India         1988        NaN
4      4  25.0  71500.0     6.4  Australia         2002        NaN

CONVERTING THE 'ESTABLISHED' COLUMN

In [15]:
 #Converting 'Established' column to datetime if applicable
df['Established'] = pd.to_datetime(df['Established'], format='%Y', errors='coerce')

CONVERTING THE 'EASY APPLY' COLUMN

In [16]:
# Converting 'Easy Apply' column to boolean
df['Easy Apply'] = df['Easy Apply'].map({'TRUE': True, np.nan: False})

In [17]:
df.head()

   Index   Age   Salary  Rating   Location Established  Easy Apply
0      0  44.0  71500.0     5.4      India  1999-01-01        True
1      1  66.0  60500.0     3.5   New York  2002-01-01        True
2      2   NaN  83000.0    -1.0   New York         NaT       False
3      3  64.0  71500.0     4.4      India  1988-01-01       False
4      4  25.0  71500.0     6.4  Australia  2002-01-01       False

In [18]:
print(df)

    Index   Age   Salary  Rating   Location Established  Easy Apply
0       0  44.0  71500.0     5.4      India  1999-01-01        True
1       1  66.0  60500.0     3.5   New York  2002-01-01        True
2       2   NaN  83000.0    -1.0   New York         NaT       False
3       3  64.0  71500.0     4.4      India  1988-01-01       False
4       4  25.0  71500.0     6.4  Australia  2002-01-01       False
5       5  44.0  83000.0     1.4      India  1999-01-01        True
6       6  21.0  71500.0     0.0   New York         NaT       False
7       7  44.0  71500.0    -1.0  Australia         NaT       False
8       8  35.0  71500.0     5.4   New York         NaT       False
9       9  22.0  71500.0     7.7      India         NaT        True
10     10  55.0  29500.0     5.4      India  2008-01-01        True
11     11  44.0  29500.0     6.7      India  2009-01-01       False
12     12   NaN  71500.0     0.0      India  1999-01-01       False
13     13  25.0  71500.0    -1.0  Australia  2019-01-01        True
14     14  66.0  71500.0     4.0  Australia  2020-01-01        True
15     15  44.0  94500.0     3.0  Australia  1999-01-01       False
16     16  19.0  29500.0     4.5      India  1984-01-01       False
17     17   NaN  71500.0     5.3   New York  1943-01-01        True
18     18  35.0  71500.0     6.7   New York  1954-01-01        True
19     19  32.0  71500.0     3.3   New York  1955-01-01        True
20     20   NaN  71500.0     5.7   New York  1944-01-01        True
21     21  35.0  71500.0     5.0   New York  1946-01-01       False
22     22  19.0  60500.0     7.8   New York  1988-01-01        True
23     23   NaN  71500.0     2.4   New York  1999-01-01        True
24     24  13.0  71500.0    -1.0   New York  1987-01-01       False
25     25  55.0  71500.0     0.0  Australia  1980-01-01        True
26     26   NaN  60500.0     NaN      India  1934-01-01        True
27     27  52.0  71500.0     5.4      India  1935-01-01       False
28     28   NaN  63500.0     3.4  Australia  1932-01-01       False